# UnableToDeleteWallForPanel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..UnableToDeleteWallForPanel Property
BuiltInFailures..::..WallFailures Class See Also
---
Unable to delete curtain panel wall.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToDeleteWallForPanel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToDeleteWallForPanel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToDeleteWallForPanel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace